mdhardenburgh/Blinky/Packages/.cache/NXP.MKV58F24_DFP.12.0.0.pdsc
    <condition id="device.MKV58F24_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV58F24_startup_AND_driver.clock_AND_driver.common_AND_driver.flash_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_driver.xbara_AND_utility.debug_console">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKV58F24_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xbara"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.common">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.common_AND_driver.lptmr">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="device.MKV58F24_AND_component.lists_AND_driver.common">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.uart">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.common_AND_driver.uart">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKV58F24_AND_CMSIS_Include_core_cm7">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MKV58F24_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKV58F24_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKV58F24_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKV58F24_AND_device.MKV58F24_CMSIS_AND_driver.clock">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKV58F24_startup"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.edma_AND_driver.flexcan">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.edma_AND_driver.i2c">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKV58F24_AND_driver.enet">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
    </condition>
