mdhardenburgh/Blinky/Packages/.cache/NXP.MKV58F24_DFP.12.0.0.pdsc
    <condition id="device.MKV58F24_AND_driver.edma_AND_driver.uart">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKV58F24_AND_utility.debug_console">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKV58F24_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKV58F24_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MKV58F1M0???24*" Dvendor="NXP:11"/>
      <accept Dname="MKV58F512???24*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKV58F24" Cversion="1.0.0" condition="device.MKV58F24_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV58F24_startup_AND_driver.clock_AND_driver.common_AND_driver.flash_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_driver.xbara_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MKV58F24_AND_driver.dmamux_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MKV58F24_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter" Cversion="1.0.0" condition="device.MKV58F24_AND_driver.common_AND_driver.lptmr">
      <description/>
      <files>
        <file category="sourceC" name="components/timer/lptmr_adapter.c"/>
        <file category="header" name="components/timer/timer.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.MKV58F24_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MKV58F24_AND_driver.uart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter" Cversion="1.0.0" condition="device.MKV58F24_AND_driver.common_AND_driver.uart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/uart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKV58F24_startup" Cversion="1.0.0" condition="device.MKV58F24_AND_CMSIS_Include_core_cm7">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKV58F24.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKV58F24.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV58F1M0xxx24_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV58F1M0xxx24_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV58F512xxx24_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV58F512xxx24_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV58F1M0xxx24_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV58F1M0xxx24_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV58F512xxx24_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV58F512xxx24_ram.icf"/>
        <file category="header" attr="config" name="MKV58F24.h"/>
        <file category="header" attr="config" name="MKV58F24_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MKV58F24.c"/>
        <file category="header" attr="config" name="system_MKV58F24.h"/>
      </files>
    </component>
